#Тимофей обычно спит ночью XX часов и устраивает себе днем тихий час на YY минут. Определите, сколько всего минут Тимофей спит в сутки. #
values1=int(input(''))
values2=int(input(''))
print((60*values1)+values2)
